# Retailer Dataset Analysis — Annotated Notebook

### Explanation
This cell initializes findspark so Python can locate the Spark installation, then imports required libraries.

In [1]:
import findspark
findspark.init("/opt/manual/spark")
from pyspark.sql import SparkSession, functions as F
from pyspark.sql.types import *

spark = (SparkSession.builder
         .appName("ApacheSparkile İşİhtiyaçlarına Yönelik Veri Analizi")
         .master("yarn")
         .enableHiveSupport()
         .getOrCreate()
        )

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [2]:
categories = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/categories/categories.csv")

### Explanation
This cell performs the following step in the workflow: `categories.limit(3).toPandas()`

In [3]:
categories.limit(3).toPandas()

   categoryId  categoryDepartmentId         categoryName
0           1                     2             Football
1           2                     2               Soccer
2           3                     2  Baseball & Softball

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [4]:
categories.printSchema()

root
 |-- categoryId: integer (nullable = true)
 |-- categoryDepartmentId: integer (nullable = true)
 |-- categoryName: string (nullable = true)

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [5]:
customers = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/customers/customers.csv")

### Explanation
This cell performs the following step in the workflow: `customers.limit(3).toPandas()`

In [6]:
customers.limit(3).toPandas()

,customerId,customerFName,customerLName,customerEmail,customerPassword,customerStreet,customerCity,customerState,customerZipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [7]:
customers.printSchema()

root
 |-- customerId: integer (nullable = true)
 |-- customerFName: string (nullable = true)
 |-- customerLName: string (nullable = true)
 |-- customerEmail: string (nullable = true)
 |-- customerPassword: string (nullable = true)
 |-- customerStreet: string (nullable = true)
 |-- customerCity: string (nullable = true)
 |-- customerState: string (nullable = true)
 |-- customerZipcode: integer (nullable = true)

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [8]:
departments = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/departments/departments.csv")

### Explanation
This cell performs the following step in the workflow: `departments.limit(3).toPandas()`

In [9]:
departments.limit(3).toPandas()

   departmentId departmentName
0             2        Fitness
1             3       Footwear
2             4        Apparel

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [10]:
departments.printSchema()

root
 |-- departmentId: integer (nullable = true)
 |-- departmentName: string (nullable = true)

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [11]:
order_items = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/order_items/order_items.csv")

### Explanation
This cell performs the following step in the workflow: `order_items.limit(3).toPandas()`

In [12]:
order_items.limit(3).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [13]:
order_items.printSchema()

root
 |-- orderItemName: integer (nullable = true)
 |-- orderItemOrderId: integer (nullable = true)
 |-- orderItemProductId: integer (nullable = true)
 |-- orderItemQuantity: integer (nullable = true)
 |-- orderItemSubTotal: double (nullable = true)
 |-- orderItemProductPrice: double (nullable = true)

### Explanation
This cell counts distinct values (useful to understand cardinality).

In [14]:
order_items.select("orderItemOrderId").distinct().count()

57431

### Explanation
This cell counts rows to understand table size.

In [15]:
order_items.count()

172198

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [16]:
orders = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/orders/orders.csv") \
.withColumn(
    'orderDate', F.to_timestamp(
        F.col('orderDate',), "yyyy-MM-dd HH:mm:ss.S"))

### Explanation
This cell performs the following step in the workflow: `orders.limit(3).toPandas()`

In [17]:
orders.limit(3).toPandas()

   orderId  orderDate  orderCustomerId      orderStatus
0        1 2013-07-25            11599           CLOSED
1        2 2013-07-25              256  PENDING_PAYMENT
2        3 2013-07-25            12111         COMPLETE

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [18]:
orders.printSchema()

root
 |-- orderId: integer (nullable = true)
 |-- orderDate: timestamp (nullable = true)
 |-- orderCustomerId: integer (nullable = true)
 |-- orderStatus: string (nullable = true)

### Explanation
This cell counts rows to understand table size.

In [19]:
orders.count()

68883

### Explanation
This cell reads a CSV table from HDFS as a Spark DataFrame (with options like header/inferSchema).

In [20]:
products = spark.read.format("csv").option("header", True) \
.option("inferSchema", True) \
.option("sep", ",") \
.load("/user/train/retailer_db/products/products.csv")

### Explanation
This cell performs the following step in the workflow: `products.limit(3).toPandas()`

In [21]:
products.limit(3).toPandas()

,productId,productCategoryId,productName,productDescription,productPrice,productImage
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,None,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,None,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,None,89.99,http://images.acmesports.sports/Under+Armour+M...

### Explanation
This cell prints the DataFrame schema (columns and data types).

In [23]:
products.printSchema()

root
 |-- productId: integer (nullable = true)
 |-- productCategoryId: integer (nullable = true)
 |-- productName: string (nullable = true)
 |-- productDescription: string (nullable = true)
 |-- productPrice: double (nullable = true)
 |-- productImage: string (nullable = true)

### Explanation
This cell performs the following step in the workflow: `# Broadcast join kapatıyoruz.`

In [ ]:
# Closed the Broadcast join.
spark.conf.set("spark.sql.autoBroadcastJoinThreshold", "-1")

### Explanation
This cell joins tables (DataFrames) to build an analysis-ready dataset.

In [ ]:
# Use Shuffle sort join.
orders_and_items = order_items.join(orders, 
                        order_items.orderItemOrderId == orders.orderId)

### Explanation
This cell performs the following step in the workflow: `orders_and_items.limit(3).toPandas()`

In [26]:
orders_and_items.limit(3).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice,orderId,orderDate,orderCustomerId,orderStatus
0,348,148,502,2,100.00,50.00,148,2013-07-26,5383,PROCESSING
1,349,148,502,5,250.00,50.00,148,2013-07-26,5383,PROCESSING
2,350,148,403,1,129.99,129.99,148,2013-07-26,5383,PROCESSING

### Explanation
This cell joins tables (DataFrames) to build an analysis-ready dataset.

In [ ]:
# Use Shuffle sort join.
final_table = orders_and_items.join(products, 
                        orders_and_items.orderItemProductId == products.productId)

### Explanation
This cell performs the following step in the workflow: `final_table.limit(3).toPandas()`

In [28]:
final_table.limit(3).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice,orderId,orderDate,orderCustomerId,orderStatus,productId,productCategoryId,productName,productDescription,productPrice,productImage
0,155898,62363,858,1,199.99,199.99,62363,2014-01-19,11077,PENDING_PAYMENT,858,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...
1,163582,65452,858,1,199.99,199.99,65452,2014-05-12,5773,ON_HOLD,858,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...
2,156679,62666,858,1,199.99,199.99,62666,2014-01-28,9193,CLOSED,858,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...

### Explanation
This cell displays sample rows to inspect the DataFrame.

In [29]:
orders.select("orderStatus","orderId") \
.groupBy("orderStatus") \
.agg(F.count("orderId").alias("order_cnt")) \
.show()

+---------------+---------+
|    orderStatus|order_cnt|
+---------------+---------+
|PENDING_PAYMENT|    15030|
|       COMPLETE|    22899|
|        ON_HOLD|     3798|
| PAYMENT_REVIEW|      729|
|     PROCESSING|     8275|
|         CLOSED|     7556|
|SUSPECTED_FRAUD|     1558|
|        PENDING|     7610|
|       CANCELED|     1428|
+---------------+---------+

### Explanation
This cell displays sample rows to inspect the DataFrame.

In [30]:
final_table.select("orderStatus","orderId") \
.groupBy("orderStatus") \
.agg(F.count("orderId").alias("order_cnt")) \
.show()

+---------------+---------+
|    orderStatus|order_cnt|
+---------------+---------+
|PENDING_PAYMENT|    38031|
|       COMPLETE|    56740|
|        ON_HOLD|     9373|
| PAYMENT_REVIEW|     1797|
|     PROCESSING|    20901|
|         CLOSED|    18668|
|SUSPECTED_FRAUD|     3878|
|        PENDING|    19291|
|       CANCELED|     3519|
+---------------+---------+

### Explanation
This cell filters rows to focus on the relevant subset for analysis.

In [31]:
final_table_c = final_table.filter(F.col("orderStatus") == "CANCELED")

### Explanation
This cell performs the following step in the workflow: `final_table_c.limit(3).toPandas()`

In [32]:
final_table_c.limit(3).toPandas()

,orderItemName,orderItemOrderId,orderItemProductId,orderItemQuantity,orderItemSubTotal,orderItemProductPrice,orderId,orderDate,orderCustomerId,orderStatus,productId,productCategoryId,productName,productDescription,productPrice,productImage
0,165571,66230,858,1,199.99,199.99,66230,2014-06-11,1101,CANCELED,858,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...
1,146621,58585,858,1,199.99,199.99,58585,2013-08-25,1379,CANCELED,858,38,GolfBuddy VT3 GPS Watch,None,199.99,http://images.acmesports.sports/GolfBuddy+VT3+...
2,12869,5153,897,1,24.99,24.99,5153,2013-08-25,2673,CANCELED,897,40,Team Golf New England Patriots Putter Grip,None,24.99,http://images.acmesports.sports/Team+Golf+New+...

### Explanation
This cell groups and aggregates data to answer a business question.

In [33]:
final_data_agg = final_table_c.select("productName","orderItemProductPrice") \
.groupBy("productName") \
.agg(F.sum("orderItemProductPrice").alias("TotalPrice")) \
.orderBy(F.desc("TotalPrice"))

### Explanation
This cell performs the following step in the workflow: `final_data_agg.limit(3).toPandas()`

In [34]:
final_data_agg.limit(3).toPandas()

                                     productName  TotalPrice
0      Field & Stream Sportsman 16 Gun Fire Safe   134393.28
1  Diamondback Women's Serene Classic Comfort Bi    80094.66
2                    Pelican Sunstream 100 Kayak    66196.69

### Explanation
This cell writes the final output dataset to the target path/table.

In [35]:
import time
start_time = time.time()

final_data_agg.write \
.format("parquet") \
.mode("overwrite") \
.save("hdfs://localhost:9000/user/train/retailer_db/final_data")

print("---------- %s secs ----------" %(time.time()- start_time))

---------- 73.33414149284363 secs ----------

### Explanation
This cell displays sample rows to inspect the DataFrame.

In [42]:
final_table.select("orderDate","orderItemProductPrice") \
.withColumn("Day", F.dayofmonth("orderDate")) \
.groupBy("Day") \
.agg(F.sum("orderItemProductPrice").alias("Sum_SubTotal")) \
.orderBy(F.asc("Day")) \
.show()

+---+-----------------+
|Day|     Sum_SubTotal|
+---+-----------------+
|  1|828566.4400000047|
|  2|731567.0500000023|
|  3|883191.2600000044|
|  4|728169.6100000018|
|  5|838607.3000000042|
|  6| 868407.600000005|
|  7|791786.7300000036|
|  8|716454.2000000024|
|  9|759440.3400000032|
| 10|817580.0600000035|
| 11|768316.4400000031|
| 12|780774.6300000037|
| 13|716423.4200000027|
| 14|734104.7700000026|
| 15|787659.3300000036|
| 16|688486.2500000015|
| 17|608955.9100000011|
| 18|796832.7000000034|
| 19|721411.5000000024|
| 20|787598.7700000035|
+---+-----------------+
only showing top 20 rows

### Explanation
This cell performs the following step in the workflow: `spark.stop()`

In [44]:
spark.stop()